Revit 2027 API
BuiltInFailures.ElectricalFailures.BankDistanceSmallerThanDiameter Property
 The distance value is smaller than the conduit diameter, please enter a larger value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BankDistanceSmallerThanDiameter { get; }
Public Shared ReadOnly Property BankDistanceSmallerThanDiameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BankDistanceSmallerThanDiameter {
	FailureDefinitionId^ get ();
}
static member BankDistanceSmallerThanDiameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace